#include "Kamu.h"

//=======playTempMotion,saveTempMotion=======
//---------------필수 설정-------------------
/*재생할 프레임의 총 길이를 의미합니다.*/
#define FRAME_LENGTH 17

//============================================

//==============saveTempMotion==============
//---------------필수 설정-------------------
/*저장할 슬롯의 번호를 지정합니다.*/
#define CUSTOM_SLOT 0
/*저장할 동작의 이름을 지정합니다.
최대 20-Byte 까지 설정 가능하며,
영어는 글자당 1-Byte, 한글은 3-Byte가 사용됩니다.
*/
#define MOTION_NAME "댄스 3            "

/*모션 저장에 사용되는 구조체 입니다.
수정할 필요 없습니다.
*/

/*
모션 저장에 사용되는 구조체 입니다.
수정할 필요 없습니다.
*/
const HEADER motionheader = {
    CUSTOM_SLOT,
    MOTION_NAME,
    FRAME_LENGTH};

/**************************************************************************************************************************************************************/

//===============================TempMotion 각도 설정===========================
/*
각 프레임의 개별 모터의 각도를 설정합니다.
FRAME_LENGTH 개수 만큼 작성해 주세요.
*/
const int8_t frame0[MOTORS_KAMU] = {
0, 0, 0, 
0, 0, 0, 
0, 0, 0, 
0, 0, 0, 
0, 0, 0, 
0, 0, 0};
const int8_t frame1[MOTORS_KAMU] = {
56, 2, -22, 
50, 0, 18, 
-16, 2, 0, 
-42, -36, 18, 
-32, 0, -22, 
20, -2, 0};
const int8_t frame2[MOTORS_KAMU] = {
0, 0, 0, 
0, 0, 0, 
0, 0, 0, 
0, 0, 0, 
0, 0, 0, 
0, 0, 0};
const int8_t frame3[MOTORS_KAMU] = {
4, 2, -70, 
-26, -4, 16, 
-26, -12, -4, 
32, -20, 20, 
-8, 0, -8, 
16, 10, 0};
const int8_t frame4[MOTORS_KAMU] = {
-40, -14, -16, 
2, -4, 28, 
-40, -12, -4, 
32, -26, 16, 
-8, 0, -12, 
22, 10, 0};
const int8_t frame5[MOTORS_KAMU] = {
92, 2, -8, 
14, -4, 42, 
-50, -8, -4, 
32, -32, 20, 
-8, 0, -36, 
38, 0, 0};
const int8_t frame6[MOTORS_KAMU] = {
-40, -14, -16, 
2, -4, 20, 
-22, -2, -4, 
32, -26, 16, 
-8, 0, -18, 
18, 0, 0};
const int8_t frame7[MOTORS_KAMU] = {
86, -14, -10, 
50, 0, 42, 
-50, -8, 0, 
-62, -26, 16, 
-56, 0, -36, 
44, 8, 0};
const int8_t frame8[MOTORS_KAMU] = {
70, -8, -76, 
4, 0, 28, 
-38, -12, 0, 
-118, -26, 64, 
2, 0, -16, 
18, 2, 0};
const int8_t frame9[MOTORS_KAMU] = {
86, -14, -10, 
50, -4, 38, 
-48, -10, -4, 
-62, -26, 16, 
-56, 0, -28, 
44, 16, 0};
const int8_t frame10[MOTORS_KAMU] = {
86, -14, -58, 
82, -4, 34, 
-48, -14, -4, 
-62, -26, 70, 
-102, 0, -28, 
44, 16, 0};
const int8_t frame11[MOTORS_KAMU] = {
86, -14, -10, 
50, -4, 34, 
-50, -16, -4, 
-62, -26, 16, 
-56, 0, -32, 
44, 12, 0};
const int8_t frame12[MOTORS_KAMU] = {
86, -14, -58, 
82, -4, 36, 
-50, -14, -4, 
-62, -26, 70, 
-102, 0, -32, 
44, 10, 0};
const int8_t frame13[MOTORS_KAMU] = {
84, 36, -4, 
12, 0, 24, 
-24, 0, 0, 
18, 12, 30, 
-32, 2, -28, 
36, 6, 0};
const int8_t frame14[MOTORS_KAMU] = {
0, 0, -8, 
0, 0, 0, 
0, 0, 0, 
0, 0, 8, 
0, 0, 0, 
0, 0, 0};
const int8_t frame15[MOTORS_KAMU] = {
-26, 2, -16, 
0, 0, 26, 
-24, 2, 0, 
40, -12, 12, 
0, 0, -28, 
40, 12, 0};
const int8_t frame16[MOTORS_KAMU] = {
-20, 26, -22, 
10, 0, 26, 
-40, -14, 0, 
20, -26, 22, 
-10, 0, -26, 
40, 14, 0};

/*
FRAME_LENGTH 크기에 맞춰 배열을 작성해 주세요.
*/
const int8_t *motion0_angles[FRAME_LENGTH] = {
(int8_t *)&frame0, (int8_t *)&frame1, (int8_t *)&frame2, (int8_t *)&frame3, (int8_t *)&frame4, 
(int8_t *)&frame5, (int8_t *)&frame6, (int8_t *)&frame7, (int8_t *)&frame8, (int8_t *)&frame9, 
(int8_t *)&frame10, (int8_t *)&frame11, (int8_t *)&frame12, (int8_t *)&frame13, (int8_t *)&frame14, 
(int8_t *)&frame15, (int8_t *)&frame16};

//===============================TempMotion 시간 설정===========================
/*
프레임별 동작 시간을 설정합니다.
FRAME_LENGTH 크기에 맞춰 배열을 작성해 주세요.
*/
const uint16_t motion0_times[FRAME_LENGTH] = {
300, 350, 300, 430, 
350, 430, 350, 350, 450, 
350, 350, 350, 350, 350, 
300, 500, 500};
