#include "Kamu.h"

//=======playTempMotion,saveTempMotion=======
//---------------필수 설정-------------------
/*재생할 프레임의 총 길이를 의미합니다.*/
#define FRAME_LENGTH 20

//============================================

//==============saveTempMotion==============
//---------------필수 설정-------------------
/*저장할 슬롯의 번호를 지정합니다.*/
#define CUSTOM_SLOT 0
/*저장할 동작의 이름을 지정합니다.
최대 20-Byte 까지 설정 가능하며,
영어는 글자당 1-Byte, 한글은 3-Byte가 사용됩니다.
*/
#define MOTION_NAME "댄스 4            "

/*모션 저장에 사용되는 구조체 입니다.
수정할 필요 없습니다.
*/

/*
모션 저장에 사용되는 구조체 입니다.
수정할 필요 없습니다.
*/
const HEADER motionheader = {
    CUSTOM_SLOT,
    MOTION_NAME,
    FRAME_LENGTH};

/**************************************************************************************************************************************************************/

//===============================TempMotion 각도 설정===========================
/*
각 프레임의 개별 모터의 각도를 설정합니다.
FRAME_LENGTH 개수 만큼 작성해 주세요.
*/
const int8_t frame0[MOTORS_KAMU] = {
-28, 26, -22, 
2, 0, 26, 
-36, -10, 0, 
28, -26, 22, 
-2, 0, -18, 
28, 10, 0};
const int8_t frame1[MOTORS_KAMU] = {
-28, 2, -22, 
2, 0, 30, 
-40, -10, 0, 
28, -2, 22, 
-2, 0, -32, 
40, 8, 0};
const int8_t frame2[MOTORS_KAMU] = {
-28, 26, -22, 
2, 0, 32, 
-44, -10, 0, 
28, -26, 22, 
-2, 0, -32, 
44, 10, 0};
const int8_t frame3[MOTORS_KAMU] = {
88, 38, -26, 
-4, 0, 36, 
-46, -10, 0, 
-2, -2, 58, 
-88, 0, -36, 
46, 10, 0};
const int8_t frame4[MOTORS_KAMU] = {
-28, 26, -22, 
26, 0, 36, 
-46, -10, 0, 
28, -26, 22, 
-26, 0, -36, 
46, 10, 0};
const int8_t frame5[MOTORS_KAMU] = {
88, 26, -24, 
-4, 0, 26, 
-28, -2, 0, 
-2, -2, 58, 
-88, 0, -26, 
32, 6, 0};
const int8_t frame6[MOTORS_KAMU] = {
88, -10, -24, 
-4, -2, 14, 
-14, 0, 0, 
-2, -34, 58, 
-88, 0, -14, 
8, -6, 0};
const int8_t frame7[MOTORS_KAMU] = {
88, 18, -26, 
-4, 0, 18, 
-28, -10, 0, 
-2, -12, 58, 
-88, 0, -22, 
32, 10, 0};
const int8_t frame8[MOTORS_KAMU] = {
48, 18, -22, 
78, 0, 16, 
-16, 0, 0, 
-8, -18, 54, 
50, 0, -16, 
16, 0, 0};
const int8_t frame9[MOTORS_KAMU] = {
44, 6, -60, 
94, 0, 8, 
-8, 0, 0, 
-8, -12, 36, 
64, 0, -16, 
18, 2, 0};
const int8_t frame10[MOTORS_KAMU] = {
48, 18, -22, 
78, 0, 16, 
-16, 0, 0, 
-8, -18, 52, 
50, 0, -22, 
24, 0, 0};
const int8_t frame11[MOTORS_KAMU] = {
44, 18, -60, 
94, 0, 18, 
-18, 0, 0, 
-8, -18, 34, 
62, 0, -14, 
14, 0, 0};
const int8_t frame12[MOTORS_KAMU] = {
8, 18, -48, 
-50, 0, 24, 
-22, 2, 0, 
-48, -18, 22, 
-56, 0, -18, 
16, -2, 0};
const int8_t frame13[MOTORS_KAMU] = {
8, 18, -22, 
-30, 0, 20, 
-18, 0, 0, 
-44, -18, 68, 
-94, 0, -14, 
14, 0, 0};
const int8_t frame14[MOTORS_KAMU] = {
8, 18, -48, 
-50, 0, 22, 
-22, 0, 0, 
-48, -18, 22, 
-70, 0, -22, 
22, 0, 0};
const int8_t frame15[MOTORS_KAMU] = {
8, 18, -24, 
-62, 0, 36, 
-40, -4, 0, 
-44, -18, 60, 
-94, 0, -34, 
42, 8, 0};
const int8_t frame16[MOTORS_KAMU] = {
0, 0, 0, 
0, 0, 0, 
0, 0, 0, 
0, 0, 0, 
0, 0, 0, 
0, 0, 0};
const int8_t frame17[MOTORS_KAMU] = {
18, 0, -70, 
86, 0, 18, 
-18, 0, 0, 
-44, -28, 100, 
-78, 0, -10, 
20, 10, 0};
const int8_t frame18[MOTORS_KAMU] = {
108, 28, -100, 
78, 0, 16, 
-22, -6, 0, 
-64, 0, 44, 
-64, 0, -18, 
14, -4, 0};
const int8_t frame19[MOTORS_KAMU] = {
102, 28, -26, 
8, 0, 24, 
-42, -18, 0, 
8, 0, 68, 
-56, 0, -24, 
26, 2, 0};

/*
FRAME_LENGTH 크기에 맞춰 배열을 작성해 주세요.
*/
const int8_t *motion0_angles[FRAME_LENGTH] = {
(int8_t *)&frame0, (int8_t *)&frame1, (int8_t *)&frame2, (int8_t *)&frame3, (int8_t *)&frame4, 
(int8_t *)&frame5, (int8_t *)&frame6, (int8_t *)&frame7, (int8_t *)&frame8, (int8_t *)&frame9, 
(int8_t *)&frame10, (int8_t *)&frame11, (int8_t *)&frame12, (int8_t *)&frame13, (int8_t *)&frame14, 
(int8_t *)&frame15, (int8_t *)&frame16, (int8_t *)&frame17, (int8_t *)&frame18, (int8_t *)&frame19};


//===============================TempMotion 시간 설정===========================
/*
프레임별 동작 시간을 설정합니다.
FRAME_LENGTH 크기에 맞춰 배열을 작성해 주세요.
*/
const uint16_t motion0_times[FRAME_LENGTH] = {
200, 300, 300, 400, 
300, 400, 400, 400, 400, 
400, 400, 400, 400, 400, 
400, 400, 300, 1000, 1000, 
1000};
